# -*- coding: utf-8 -*-

import torch
from transformers import AutoModelForCausalLM, AutoTokenizer

model_name = "kakaocorp/kanana-nano-2.1b-instruct"

model = AutoModelForCausalLM.from_pretrained(
    model_name,
    torch_dtype=torch.bfloat16,
    trust_remote_code=True,
).to("cuda")
tokenizer = AutoTokenizer.from_pretrained(model_name)

prompt = """
“사는 모습은 달라도, 우리는 누구나 스토너다.”

조용하고 절망적인 생에 관한 소박한 이야기,
그러나 50년의 시차를 지나 전 세계인의 마음을 사로잡은 위대한 이야기!

내셔널 북 어워드(NBA) 수상작가 존 윌리엄스 장편소설 《스토너》
★2013 워터스톤 올해의 책 ★영국, 프랑스, 독일, 네덜란드 등 전 유럽 베스트셀러

■ 작품 소개

출간 후 50년, 미국을 넘어 전 세계를 사로잡은 위대한 소설,《스토너》
묵묵히 자신의 길을 걷고자 했던 한 남자의 삶이 시간과 공간을 넘어 지금 우리의 마음을 파고든다.

지난 2013년, 영국 최대의 체인 서점인 ‘워터스톤’ 올해의 책으로 선정된 도서는 요즘 가장 주목받는 작가라는 줄리언 반스의 책도, 케이트 앳킨스의 책도 아니었다. 농부의 아들로 태어나 문학을 사랑했으며 묵묵히 자신의 길을 가고자 했던 내성적인 한 남자의 일생을 그린 소박하기만 한 이야기,《스토너》가 바로 그 주인공이었다. 특별한 계기가 있거나 새삼스러운 이슈로 주목받은 것도 아니었다. 언뜻 초라한 실패담에 불과해 보이는 이 책은, 누구의 탓도 하지 않고 묵묵히 자신의 방식으로 슬픔을 받아들이는 주인공 윌리엄 스토너의 일생이 큰 공감을 불러일으키며 유럽 독자들의 마음을 온통 사로잡았다. 1965년 미국에서 발표된 후, 오랜 시간 동안 독자들에게 잊힌《스토너》는 영국, 프랑스, 독일, 네덜란드 등 유럽 출판계와 평론가, 독자들의 열렬한 반응을 이끌어내며 베스트셀러가 되었다. 50년의 시차를 가볍게 뛰어넘어, 작가 존 윌리엄스가 세상을 떠난 지 20년 만에 비로소 제대로 된 세상의 평가를 받게 된 것이다. 미국과 유럽을 넘어 전 세계에 ‘늦고도 새로운 감동’을 전한 베스트셀러.《스토너》가 드디어 한국 독자들을 찾아왔다.

몇 번의 성공과 실패가 아닌, 반드시 ‘일생을 걸고’ 무언가를 증명해내야 하는 삶이 있다.
이것이 평범하고 조용한 스토너의 삶에 귀 기울이는 이유이자 뜨거운 감동의 근원이다.

농부의 아들 윌리엄 스토너는 열아홉 살에 농업을 배우기 위해 대학에 진학한다. 스스로의 의지와는 상관없이 선택했던 길. 그런데, 영문학개론 수업에서 접한 셰익스피어의 일흔세 번째 소네트가 그의 인생을 온통 바꾸어놓는다. 문학을 사랑하게 된 것이다. 고향에 돌아가는 대신 대학에 남아 영문학도의 길을 택한 스토너. 사랑하는 여인과 결혼해 가정을 이루고, 교수가 되어 교육자로서의 삶을 살아가게 된다. 교내의 정치나 출세보다는 학문에 대한 성취에 더 열중하고 가정을 사랑한 그였지만 어찌된 일인지 대학에서도 집에서도 그의 위치는 불안하기만 하다. 가족과 동료들로부터 고립되어 슬프고 쓸쓸한 그의 삶은 세상의 기준으로 보면 실패와 다름없다. 그러나 세계대전과 대공황 속에서도, 개인적인 불행과 사랑의 실패에 시달리면서도, 갑작스러운 병마와 싸우면서도, 그는 마지막까지 자기 자신으로 살고자 한다. 일생을 바친 그의 연구처럼 자신의 일생을 통해 무언가를 증명하려는 듯.

때로 세상은 너무나 쉽게 ‘성공한 삶’과 ‘실패한 삶’을 나누어놓는다. 스토너 또한 몇 번의 소소한 성공과 실패를 겪지만 세상의 기준에서 그의 삶은 실패자의 그것과 다름없다. 그러나 작가 존 윌리엄스가 스토너의 삶을 그리는 방법은 조금 달랐다. 작가는 특유의 집요하리만치 세밀한 서술로 특별할 것 없는 한 남자의 인생을 진실하고 강렬하게, 인간에 대한 연민을 품고 펼쳐 보인다. 주인공 스토너에 깊이 공감하며 책을 읽어나가는 독자들이 그가 작은 성공을 거두는 순간에조차 처연함을 느끼는 것도 그래서인지 모른다. 이야기는 스토너의 탄생으로 시작해 죽음으로 끝을 맺는다. 평범한 한 사람의 일생에 인생의 모든 빛나고 특별한 순간이 담겨 있을 수 있다는 통찰과 감동은 책을 덮은 후 갑자기, 한꺼번에 독자의 마음에 찾아온다. 그것은 ‘쓸쓸한 삶’이었으나 우리는 누구나 철저히 혼자라는 인생의 진리, 그럼에도 자신의 고독 속에서 빛나는 무언가를 성취한 이의 묵묵한 투쟁이 전하는 감동이다. 남보다 특별한 주인공을 설정하고 극적 성공과 화려한 몰락을 통해 인생의 본질을 이야기 하는 대부분의 고전 문학과는 대조적인 접근, 서술이지만 전하는 감동은 다르지 않으며 오히려 더욱 깊고도 비밀스럽다. 이것이 평범이 쌓여 만들어내는 비범함이자 소설 《스토너》를 50년의 세월이 지나 주목받게 한 원동력은 아닐까.

슬픔과 고독을 견디며 자신의 길을 걷는 당신과 닮은 이야기.
사는 모습은 달라도, 우리는 누구나 스토너다.

1965년 출간 당시 문단과 평단의 호평에도 크게 어필하지 못하고 긴 세월 동안 잊힌 소설 《스토너》. 가치를 아는 작가들이나 교수들만 어렵게 구해 읽던 책이 50년의 세월이 지나 세계 곳곳의 많은 사람들에게 뜨겁게 읽히기까지 눈 밝은 작가와 출판인들의 노력이 있었다. 한국에서도 사랑받고 있는 프랑스의 여류작가 안나 가발다가 작품을 프랑스어 판으로 번역한 것을 시작으로 유럽에 알려지기 시작했고, 영미권 최대의 출판사인 랜덤하우스의 계열사 ‘빈티지 클래식스’ 출판사는 스콧 피츠제럴드의《위대한 개츠비》 전자책에 《스토너》의 1장을 넣는 방법으로《스토너》를 홍보했다. 담담하고 무심한 듯하지만 꽉 찬 문장으로 섬세하게 묘사된 이야기와 조용하고 내성적인 ‘스토너’라는 인물은 놀랍게도 화려한 삶, 막대한 부, 성공에 대한 열망이 넘치는 주인공 개츠비와는 정반대의 매력으로 독자들의 눈을 사로잡았다.

배우 톰 행크스는 이렇게 말했다. “이것은 그저 대학에 가서 교수가 된 사람의 이야기이다. 하지만 무엇보다도 매혹적인 이야기이기도 하다.” 작가 존 윌리엄스가 그리는 주인공 스토너의 모습이 이토록 지금, 여기, 우리의 공감을 불러일으키는 이유는 무엇일까. 성공보다는 실패의 가능성이 더 큰 이른바 ‘피로 사회’ 속에서 스스로를 돌볼 여유가 상대적으로 적은 현대인들에게 스토너가 겪었을 좌절과 슬픔, 외로움이 더 깊고 절실하게 다가오기 때문은 아닐까. 그럼에도 흔들림 없이 자신만의 방법으로 사람들을 사랑하고, 용서하며 자신만의 인생을 살았던 윌리엄 스토너. 그의 존재가 전하는 위안과 용기에 마음을 열어보는 것은 어떨까.

■ 미디어 리뷰

“위대한 소설이라기보다 완벽한 소설이다. 이야기 솜씨가 워낙 훌륭하고 글이 아름다우며, 감동적이라서 숨이 막힐 정도다.”
_뉴욕 타임스

“전 세계 출판 시장을 통틀어 가장 놀라운 베스트셀러는 단연 존 윌리엄스의 고전 소설《스토너》이다.”
_퍼블리셔스 위클리

“놀라울 정도로 아름다운 문체의 소설. 단순하지만 찬란한 이야기. 평범한 삶과 조용한 비극에 대한, 잘 알려지지는 않았지만 위대한 작가의 걸작.”
_가디언

“대가의 솜씨가 엿보이는 초상화…… 윌리엄스는 지극히 힘든 이 이야기를 풀어 놓으면서 뛰어난 통제력을 보여준다.”
_뉴요커

“조용하고 절망적인 생애에 관한 소박한 이야기, 존 윌리엄스의《스토너》는 세상이 잊고 있었던 20세기의 걸작이다.”
_선데이 타임스

“영어로 된 소설, 아니 종류를 막론한 모든 문학작품 중에 인간적인 지혜나 예술적인 측면에서 이만한 수준의 근처에라도 도달한 작품은 극히 드물다.”
_파이넨셜 타임스

“이것은 그저 대학에 가서 교수가 된 사람의 이야기일 뿐이다. 하지만 무엇보다도 매혹적인 이야기이다.”
_톰 행크스

“지난 세기에 잊힌 위대한 소설 중 하나.”
_칼럼 매캔(《거대한 지구를 돌려라》작가)

“스토너의 죽음에 대한 존 윌리엄스의 주관적인 묘사는 현대 문학에서 타의 추종을 불허한다.”
_이언 매큐언(《속죄》작가)

“찬란하고, 가차없이 슬프며 또 아름답다. 현명하고 우아한 소설.”
_닉 혼비(《어바웃 어 보이》작가)

“《스토너》는 좋은 작품이다. 주제가 탄탄하고 무게가 있으며, 읽고 난 뒤에도 마음속에 계속 남는다. 50년 만에 이 소설이 부활한 이유를 독자 여러분이 직접 찾아보기를 간절히 바란다.”
_줄리언 반스(《예감은 틀리지 않는다》작가)

“존 윌리엄스의《스토너》만큼 명확하고 깊이 있는 소설을 읽어본 적이 없다. 미국 문학의 진정한 클래식으로 대우 받아야 마땅하다.”
_채드 하바크(《수비의 기술》작가)

“《스토너》에서는 고급스러운 재미를 맛볼 수 있다. 윌리엄스 자신은 이것을 가리켜 고통과 즐거움이자 ‘현실로의 탈출’이라고 묘사했다. 명확한 문장은 그 자체로서 순수한 기쁨이 된다.”
_존 맥개헌(《Amongst women》작가)

“《스토너》와 《위대한 개츠비》, 문체만 보면 이 두 작품만큼 서로 다른 작품은 없다. 하지만 언어에 대한 영원한 사랑을 보여준다는 점, 삶의 희망에 대한 모호한 믿음과 환멸의 필연성을 말하고 있다는 점, 이상주의자와 이상, 실망, 고귀한 실패의 통렬함을 이야기한다는 점에서 서로 닮았다. 사랑스럽고 슬픈 걸작, 며칠이고 독자의 기분을 물들이는 작품이다.”
_사라 처치웰(이스트 앵글리아 대학)
"""
messages = [
    {"role": "system", "content": "너는 글에서 키워드를 뽑는 모델이야. 입력된 글에서 한국어로 된 단어 키워드 5개를 뽑아줘"},
    {"role": "user", "content": prompt}
]

input_ids = tokenizer.apply_chat_template(
    messages,
    tokenize=True,
    add_generation_prompt=True,
    return_tensors="pt"
).to("cuda")

_ = model.eval()
with torch.no_grad():
    output = model.generate(
        input_ids,
        max_new_tokens=72,
        do_sample=False,
    )

print(tokenizer.decode(output[0], skip_special_tokens=True))

# Output:
# Sure! Here are the given dates converted to the `YYYY/MM/DD` format:

# 1. **12/31/2021**
#    - **YYYY/MM/DD:** 2021/12/31

# 2. **02-01-22**
#    - **YYYY/MM/DD:** 2022/02/01

# So, the converted dates are ...
