archetype_tag_map = {
    "알바트로스": [
        # 장르
        "판타지", "SF", "모험",
        # 감정
        "역동적인", "황홀한", "몽환적인",
        # 주제
        "전쟁과 평화", "환경과 생태", "인공지능과 정보화",
        # 테마
        "재난·서바이벌", "기억과 시간", "미지의 영역 탐험",
        # 설정
        "디스토피아", "유토피아", "포스트 아포칼립스", "다중 우주",
        "시간 여행", "초현실적 공간", "이세계", "신화적 세계", "가상 현실", "사이버펑크", "기후 변화 세계"
    ],
    "독수리": [
        # 장르
        "철학적", "역사소설", "드라마", "범죄",
        # 감정
        "어두운", "불안감을 조성하는", "역설적인", "냉소적인",
        # 주제
        "사회 비판적", "불평등", "젠더 문제", "혁명과 저항", "노동과 계급투쟁",
        "권력과 부패", "외교와 정치 음모", "무정부주의", "전통과 혁신",
        # 테마
        "도덕적 딜레마", "운명과 자유의지", "욕망과 타락",
        # 설정
        "디스토피아", "정치 음모", "권력과 부패"
    ],
    "흰 오목눈이": [
        # 장르
        "로맨스", "드라마", "가족 드라마",
        # 감정
        "감동적인", "잔잔한", "우울한", "밝고 긍정적", "낭만적인", "몰입감 높은",
        # 주제
        "이민과 정체성", "문화 충돌", "트라우마와 치유", "우정과 동료애", "가족",
        # 테마
        "성장 이야기", "정체성 탐색", "내면 탐구", "생명과 죽음",
        # 스페셜
        "의식의 흐름"
    ],
    "부엉이": [
        # 장르
        "철학적", "SF", "역사소설",
        # 감정
        "잔잔한", "역설적인",
        # 주제
        "도덕적 딜레마", "의료 및 바이오테크", "인공지능과 정보화",
        # 테마
        "기억과 시간", "이중성", "욕망과 타락", "전통과 혁신",
        # 설정
        "사이버펑크", "시간 여행"
    ],
    "까마귀": [
        # 장르
        "미스터리", "스릴러", "공포", "범죄", "서스펜스", "법정 소설", "첩보",
        # 감정
        "긴장감 있는", "불안감을 조성하는", "잔혹한",
        # 주제
        "권력과 부패", "외교와 정치 음모", "법정 드라마",
        # 테마
        "복수와 정의", "금기와 반항",
        # 스페셜
        "믿을 수 없는 화자", "단서 중심 서사"
    ],
    "카나리아": [
        # 장르
        "실험적 문체", "형식 파괴적", "메타픽션",
        # 감정
        "몽환적인", "역설적인", "초현실적인",
        # 주제
        "전통과 혁신",
        # 테마
        "내면 탐구", "기억과 시간",
        # 스페셜
        "독특한 서술 방식", "미완의 이야기", "실험적 문체", "비선형 서사", "스토리텔링"
    ],
    "앵무새": [
        # 장르
        "코미디", "로맨스", "드라마", "블랙 코미디", "스포츠",
        # 감정
        "유머러스한", "밝고 긍정적", "잔잔한",
        # 주제
        "우정과 동료애", "전통과 혁신",
        # 테마
        "성장 이야기", "금기와 반항",
        # 스페셜
        "독특한 서술 방식"
    ],
    "플라밍고": [
        # 장르
        "드라마", "공포", "철학적", "병원 소설",
        # 감정
        "우울한", "긴장감 있는", "불안감을 조성하는",
        # 주제
        "트라우마와 치유", "이중성", "생명과 죽음",
        # 테마
        "내면 탐구", "기억과 시간",
        # 스페셜
        "의식의 흐름", "미완의 이야기"
    ]
}